export const facultySections: Record<number, { name: string; value: number }[]> = {
  0: [
    {
      name: 'العلوم العسكرية',
      value: 600000,
    },
  ],
  1: [
    {
      name: 'أصول الدين',
      value: 105,
    },
    {
      name: 'الفقه وأصوله',
      value: 104,
    },
    {
      name: 'دراسات في الأديان',
      value: 109,
    },
  ],
  2: [
    {
      name: 'القانون الخاص ',
      value: 201,
    },
    {
      name: 'القانون العام ',
      value: 202,
    },
  ],
  4: [
    {
      name: 'الرياضيات ',
      value: 401,
    },
    {
      name: 'الفيزياء ',
      value: 402,
    },
    {
      name: 'الكيمياء ',
      value: 403,
    },
    {
      name: 'العلوم الحياتية ',
      value: 404,
    },
  ],
  5: [
    {
      name: 'الاقتصاد ',
      value: 507,
    },
    {
      name: ' ادارة الأعمال و الادارة العامة ',
      value: 502,
    },
    {
      name: 'التمويل والمصارف ',
      value: 503,
    },
    {
      name: 'المحاسبة ',
      value: 504,
    },
    {
      name: 'التدقيق وقانون الأعمال ',
      value: 509,
    },
  ],
  7: [
    {
      name: 'هندسة العمارة ',
      value: 703,
    },
    {
      name: ' الهندسة المدنية ',
      value: 704,
    },
    {
      name: 'هندسة المساحة ',
      value: 705,
    },
    {
      name: 'هندسة الطاقة المتجددة ',
      value: 706,
    },
  ],
  9: [
    {
      name: 'علم الحاسوب ',
      value: 901,
    },
    {
      name: ' نظم المعلومات  ',
      value: 902,
    },
    {
      name: 'الامن السيبراني ',
      value: 906,
    },
    {
      name: ' علم البيانات والذكاء الاصطناعي  ',
      value: 908,
    },
    {
      name: ' تكنولوجيا المعلومات  ',
      value: 910,
    },
  ],
  10: [
    {
      name: 'التمريض',
      value: 1001,
    },
  ],
  11: [
    {
      name: 'المناهج والتدريس',
      value: 1101,
    },
    {
      name: 'الادارة التربوية ',
      value: 1102,
    },
    {
      name: 'التربية الخاصة',
      value: 1113,
    },
    {
      name: 'دبلوم صعوبات التعلم',
      value: 1103,
    },
  ],
  3: [
    {
      name: 'اللغة العربية وآدابها',
      value: 1301,
    },
    {
      name: 'التاريخ',
      value: 1303,
    },
    {
      name: 'متطلبات الجامعة ',
      value: 1399,
    },
    {
      name: 'الجغرافيا التطبيقية',
      value: 1309,
    },
  ],
  17: [
    {
      name: 'اللغة الانجليزية وآدابها/  الادب والنقد/ اللغويات ',
      value: 1702,
    },
    {
      name: 'اللغة الفرنسية وآدابها/اللغة والأدب - فرنسي_انجليزي',
      value: 1704,
    },
    {
      name: 'اللغة والأدب/اسباني_انجليزي',
      value: 1705,
    },
    {
      name: 'اللغة والأدب/ايطالي_انجليزي',
      value: 1706,
    },
  ],
  18: [
    {
      name: 'التحاليل الطبية',
      value: 1801,
    },
    {
      name: 'التغذية والحميات',
      value: 1802,
    },
    {
      name: 'العلوم الطبية المساندة ',
      value: 1803,
    },
    {
      name: 'علوم التأهيل',
      value: 1804,
    },
  ],
  6: [
    {
      name: 'العلوم السياسية',
      value: 601,
    },
  ],
  8: [
    {
      name: 'علوم الارض والبيئة التطبيقية',
      value: 803,
    },
    {
      name: 'نظم المعلومات الجغرافية',
      value: 807,
    },
  ],
  49: [
    {
      name: 'متطلبات الكلية',
      value: 4900,
    },
    {
      name: 'العلوم الإدارية والإنسانية',
      value: 4901,
    },
    {
      name: 'الهندسة و الأنظمة الذكية',
      value: 4902,
    },
    {
      name: 'المهن الطبية',
      value: 4903,
    },
  ],
  19: [
    {
      name: 'التربية البدنية',
      value: 1901,
    },
    {
      name: 'علوم الحركة والرياضة التطبيقية',
      value: 1902,
    },
  ],
  14: [],
  99: [],
};
